* TODO Get warnings out of the code
* TODO look up router pricing 
  CLOCK: [2015-05-06 Wed 13:15]--[2015-05-06 Wed 14:37] =>  1:22
  CLOCK: [2015-05-06 Wed 11:35]--[2015-05-06 Wed 11:50] =>  0:15

* TODO Get Stratix 8300 info
  CLOCK: [2015-05-06 Wed 16:36]--[2015-05-06 Wed 19:55] =>  3:19

* TODO Look over Kevin Howze's 5300 proposal
  CLOCK: [2015-05-11 Mon 13:20]--[2015-05-11 Mon 13:50] =>  0:30
* TODO look over timelne for Rockwell Vmonitor
* TODO Look over netsuite

** Chad
** TODO Assign all customers


** Yvonne

** TODO Forecast Type -remove

** TODO Opportunity 

** TODO Try to add Cost next to Sales Price

** TODO Find out what 'exclude from rate request'

** TODO Non-default available in the customer center

** TODO Maybe make it responsive

** TODO Workflow

   
** Kevin

** TODO Per foot price on Cable
  CLOCK: [2015-05-10 Sun 09:48]--[2015-05-10 Sun 09:48] =>  0:00
* DONE Finish getting backoffice to compile
  CLOCK: [2015-05-11 Mon 13:18]--[2015-05-11 Mon 13:20] =>  0:02
  
* DONE Solve problem of hanging compiles
  CLOCK: [2015-05-11 Mon 21:13]--[2015-05-12 Tue 11:33] => 14:20

* DONE Fixing navId problem
  CLOCK: [2015-05-12 Tue 11:34]--[2015-05-12 Tue 13:40] =>  2:06

* DONE More Nav Id work... stupid Part
  CLOCK: [2015-05-12 Tue 14:05]--[2015-05-12 Tue 14:15] =>  0:10
* DONE David Baldwin
  CLOCK: [2015-05-11 Mon 13:16]--[2015-05-11 Mon 13:17] =>  0:01
